### [실습1]

In [1]:
import pandas as pd
import numpy as np

#### 1) 아래와 같은 데이터 프레임 생성

In [2]:
df = pd.DataFrame({
    'School' : ['Yeonhi', 'Yeonhi', 'Sungsan', 'Sungsan', 'Sungsan'],
    'Name' : ['Haena', 'Gisu','Una', 'Naeun', 'Ziho'],
    'Math_s' : [92,70,88,92,70]
})
df

    School   Name  Math_s
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

#### 2) school을 그룹으로 하여 수학 성적의 평균 구한 결과를 df_s에 담기

In [28]:
df_s = df.groupby('School')['Math_s'].agg('mean').rename('Avg_s').reset_index()
df_s

    School      Avg_s
0  Sungsan  83.333333
1   Yeonhi  81.000000

#### 3) df 와 df_s 두 개의 데이터 프레임을 merge 한 후 df_m 에 담기

In [29]:
df_m = pd.merge(df, df_s)
df_m

    School   Name  Math_s   Math_s_y      Avg_s
0   Yeonhi  Haena      92  81.000000  81.000000
1   Yeonhi   Gisu      70  81.000000  81.000000
2  Sungsan    Una      88  83.333333  83.333333
3  Sungsan  Naeun      92  83.333333  83.333333
4  Sungsan   Ziho      70  83.333333  83.333333

#### 4) transform() 을 이용하여 3) 과 같은 결과를 출력

In [14]:
df['Math_s_y'] = df.groupby('School')['Math_s'].transform('mean')
df

    School   Name  Math_s   Math_s_y
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

#### 5) 함수 grade(num) 를 작성

- num 이 90보다 크면 grade 는 A
- num 이 80보다 크면 grade 는 B
- num 이 70보다 크면 grade 는 C
- 그 외 grade 는 F
- 구한 grade 리턴

In [21]:
def grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B'
    elif score >= 70:
        return 'C'
    else :
        return 'F'

#### 6) df_m 에 grade 컬럼을 생성한 후 Math_s 컬럼을 이용하여 함수 grade 적용

In [22]:
df_m['grade'] = df_m['Math_s_x'].apply(grade)
df_m

    School   Name  Math_s_x   Math_s_y grade
0   Yeonhi  Haena        92  81.000000     A
1   Yeonhi   Gisu        70  81.000000     C
2  Sungsan    Una        88  83.333333     B
3  Sungsan  Naeun        92  83.333333     A
4  Sungsan   Ziho        70  83.333333     C

#### 7) sort_math() 함수 작성
- 각 school 별 Math_s 컬럼을 기반으로 가장 낮은 점수 2명에 대한 정보 리턴

In [23]:
def sort_math(df, n=3, column='Math_s'):
        return df.sort_values(column)[:n]

#### 8) School을 기준으로 그룹을 설정한 후 sort_math() 함수를 적용

In [25]:
df.groupby('School').apply(sort_math, n=2)

            School   Name  Math_s   Math_s_y
School
Sungsan 4  Sungsan   Ziho      70  83.333333
        2  Sungsan    Una      88  83.333333
Yeonhi  1   Yeonhi   Gisu      70  81.000000
        0   Yeonhi  Haena      92  81.000000